#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include "chatRoomInter.h"



/* 欢迎界面以及选择界面 */
void wolcomeInterface()
{

    system("clear");
    printf("\033[1;47m╔═════════════════════════════════════════════════════════╗\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║            欢迎来到超哥架构师之路的第一个项目           ║\033[0m\n");
    printf("\033[1;47m║             带领着第三组三个挂件实现的聊天室            ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║   在即将到来的新春之际，请允许我组向您致以最诚挚的祝福  ║\033[0m\n");
    printf("\033[1;47m║              愿您在新的一年暴富🧧!                      ║\033[0m\n");
    printf("\033[1;47m║                            被爱💏!                      ║\033[0m\n");
    printf("\033[1;47m║                            好运常在🤩!                  ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║                ps:（按回车键继续哦）                    ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m╚═════════════════════════════════════════════════════════╝\033[0m\n");

    char any;
    getchar();
    
    system("clear");
    printf("\033[1;47m╔═════════════════════════════════════════════════════════╗\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║                     请选择您的选项                      ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║                   1、注  册                             ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║                   2、登  录                             ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║          如果您是第一次使用的用户请选择注册选项         ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m╚═════════════════════════════════════════════════════════╝\033[0m\n");

}

/* 主界面 */
void mainInterface()
{
    system("clear");
    printf("\033[1;47m╔═════════════════════════════════════════════════════════╗\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║                 欢迎使用聊天室(Alpha)                   ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║            开始跟朋友们交流吧! Have a nice day!         ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m║                   1、 添 加 好 友                       ║\033[0m\n");
    printf("\033[1;47m║                   2、 查 看 好 友                       ║\033[0m\n");
    printf("\033[1;47m║                   3、 发 起 群 聊                       ║\033[0m\n");
    printf("\033[1;47m║                   4、 删 除 好 友                       ║\033[0m\n");
    printf("\033[1;47m║                   0、 退 出 登 录                       ║\033[0m\n");
    printf("\033[1;47m║                   X、 注 销 账 号                       ║\033[0m\n");
    printf("\033[1;47m║                                                         ║\033[0m\n");
    printf("\033[1;47m╚═════════════════════════════════════════════════════════╝\033[0m\n");
}

/* 注册界面 */
void loginInterface();

/* 登录界面 */
void enterInterface();

/* 注销界面 */
void logoutInterface();

/* 私聊界面 */
void privateChatInterface();

/* 群聊界面 */
void groupChatInterface();

